# Vowels (স্বরবর্ণ)
[*2437..2443, *2447..2448, *2451..2452].map {|c| c.chr(Encoding::UTF_8)}

# Numbers (সংখ্যা)
[*2534..2543].map {|c| c.chr(Encoding::UTF_8)}

# Consonants (ব্যঞ্জনবর্ণ)
[*2453..2472, *2474..2480, 2482, *2486..2489, *2524..2525, 2527, 2510, *2433..2435].map {|c| c.chr(Encoding::UTF_8)}

# Vowel Diacritics (কার)
[*2494..2499, *2503..2504, *2507..2508].map {|c| c.chr(Encoding::UTF_8)}

# Vowels + Numbers + Consonants + Vowel Diacritics
[*2437..2443, *2447..2448, *2451..2452, *2534..2543, *2453..2472, *2474..2480, 2482, *2486..2489, *2524..2525, 2527, 2510, *2433..2435, *2494..2499, *2503..2504, *2507..2508].map {|c| c.chr(Encoding::UTF_8)}